# ============================================================================
# Homebrew Bundle - Package Backup
# ============================================================================
# Auto-generated with: brew bundle dump --file=~/.dotfiles/Brewfile --force --describe
# Install on new machine: brew bundle --file=~/.dotfiles/Brewfile
# Update this file: brew bundle dump --file=~/.dotfiles/Brewfile --force --describe
# ============================================================================

tap "dart-lang/dart"
tap "derailed/k9s"
tap "fluxcd/tap"
tap "jesseduffield/lazygit"
tap "joshmedeski/sesh"
tap "powershell/tap"
tap "pulumi/tap"
tap "sass/sass"
tap "zkondor/dist"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Kubernetes package manager
brew "helm"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq", link: true
# Command-line utility to interact with linkerd
brew "linkerd"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Text-based web browser
brew "lynx"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Development kit for the Java programming language
brew "openjdk@11"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Development kit for the Java programming language
brew "openjdk"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Flux CLI
brew "fluxcd/tap/flux"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# Formula to install PowerShell
brew "powershell/tap/powershell", link: false
# Pulumi - Modern Infrastructure as Code. Any cloud, any language 
brew "pulumi/tap/pulumi"
# Stylesheet Preprocessor
brew "sass/sass/sass"
# Virtual Audio Driver
cask "blackhole-2ch"
cask "font-symbols-only-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Command-line shell and scripting language
cask "powershell"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# A tool to toggle Macbook's infamous notch in one click with automation support
cask "znotch"
vscode "angular.ng-template"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "johnpapa.vscode-peacock"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "redhat.vscode-yaml"
